Repository: PeterStrick/ViVeTool-GUI
Catalog: ViVeTool-GUI.FeatureScanner/ScannerUI.*.resx
Languages: es, id, it, ja, pt_br, zh

# RPVP_Setup.Text
source: Introduction and Setup
es: Introducción y Configuración
id: Pengenalan dan Persiapan
it: Introduzione e impostazioni
ja: 導入とセットアップ
pt_br: Introdução e configuração
zh: 简介和设置

# RPVP_DownloadPDB.Text
source: Download Debug Symbols
es: Descargar Símbolos de Depuración
id: Unduh Simbol Debug
it: Scarica simboli di debug
ja: デバッグシンボルをダウンロード
pt_br: Baixar símbolos de depuração
zh: 下载调试符号

# RPVP_ScanPDB.Text
source: Scan Debug Symbols for Feature IDs
es: Escanear Símbolos de Depuración para IDs de Características
id: Pindai Simbol Debug untuk ID Fitur
it: Analizza i simboli di debug per gli ID funzione
pt_br: Verificar símbolos de depuração por IDs de recursos
zh: 扫描调试符号以获取 Feature ID

# RPVP_Done.Text
source: Done
es: Hecho
id: Selesai
it: Fine
ja: 完了しました
pt_br: Concluído
zh: 完成

# RPVP_AboutAndSettings.Text
source: About & Settings
es: Acerca de y Configuración
id: Tentang & Pengaturan
it: Info e Impostazioni
ja: バージョン情報と設定
pt_br: Sobre & configurações
zh: 关于 & 设置

# __DBG_UnlockAllTabs.Text
source: Unlock all Tabs
id: Buka semua Tab

# __DBG_AddJunctions.Text
source: Add Junctions
id: Tambah Junctions

# __DBG_RemoveJunctions.Text
source: Remove Junctions
id: Hapus Junctions

# __DBG_ScanSymbols.Text
source: Scan for symbols immediately, set text boxes first
id: Pindai simbol segera, atur text box terlebih dahulu

# __DBG_OPTIONS.Text
source: [DEBUG OPTIONS]
id: [OPSI DEBUG]

# RL_SymbolPath.Text
source: Path to store PDB Files
es: Ruta para almacenar archivos PDB
id: Jalur untuk menyimpan File PDB
it: Percorso memorizzazione file PDB
pt_br: Caminho para armazenar arquivos PDB
zh: 存储 PDB 文件的目录

# RL_DbgPath.Text
source: Path to symchk.exe
es: Ruta a symchk.exe
id: Jalur ke symchk.exe
it: Cartella per symchk.exe
ja: symchk.exeのパス
pt_br: Caminho para symchk.exe
zh: 指向 symchk.exe 的路径

# RB_Continue.Text
source: Continue
es: Continuar
id: Lanjutkan
it: Continua
ja: 続行
pt_br: Continuar
zh: 继续

# RB_SymbolPath_Browse.Text
source: Browse
es: Examinar
id: Jelajahi
it: Naviga
ja: 参照
pt_br: Procurar
zh: 浏览

# RB_DbgPath_Browse.Text
source: Browse
es: Examinar
id: Jelajahi
it: Naviga
ja: 参照
pt_br: Procurar
zh: 浏览

# RTB_SymbolPath.NullText
source: Path to store the downloaded Debugging Symbols to
es: Ruta para almacenar los símbolos de depuración descargados
id: Jalur untuk menyimpan Simbol Debugging yang diunduh ke
pt_br: Caminho para armazenar os símbolos de depuração baixados
zh: 选择用于存储调试符号的文件夹

# RTB_DbgPath.NullText
source: Path to symchk.exe from the Windows 10/11 SDK
es: Ruta a symchk.exe del SDK de Windows 10/11
id: Jalur ke symchk.exe dari Windows 10/11 SDK
it: Percorso file symchk.exe SDK di Windows 10/11
ja: Windows 10/11 SDKのsymchk.exeのパス
pt_br: Caminho para symchk.exe do Windows 10/11 SDK
zh: 指向 Windows 10/11 SDK 中 symchk.exe 的路径

# RL_DownloadIntroduction.Text
source: <html><p><span style="font-size: 11pt">Now that you are all set up, it is time to download the Program Debug Databases. The Application will automatically download PDB Files for .exe and .dll Files in the following Folders to your specified symbol folder, and will analyse them afterwards:</span></p><p><span style="font-size: 11pt"></span></p><p><span style="font-size: 9pt">C:\Windows,</span><span style="font-size: 9pt"> C:\Program Files, C:\Program Files (x86)</span></p><p><span style="font-size: 11pt"></span></p><p><span style="font-size: 11pt">This will take a long time, depending on the amount of programs and apps that you have currently installed.</span></p></html>
es: <html><p><span style="font-size: 11pt">Ahora que todo está configurado, es hora de descargar las bases de datos de depuración del programa. La aplicación descargará automáticamente archivos PDB para archivos .exe y .dll en las siguientes carpetas hacia la carpeta de símbolos especificada, y los analizará después:</span></p><p><span style="font-size: 11pt"></span></p><p><span style="font-size: 9pt">C:\Windows,</span><span style="font-size: 9pt"> C:\Program Files, C:\Program Files (x86)</span></p><p><span style="font-size: 11pt"></span></p><p><span style="font-size: 11pt">Esto llevará mucho tiempo, dependiendo de la cantidad de programas y aplicaciones que tengas instaladas actualmente.</span></p></html>
id: <html><p><span style="font-size: 11pt">Sekarang setelah Anda siap, sekarang saatnya mengunduh Program Debug Databases. Aplikasi akan secara otomatis mengunduh File PDB untuk File .exe dan .dll di Folder berikut ke folder simbol yang Anda tentukan, dan akan menganalisisnya setelahnya:</span></p><p><span style="font-size: 11pt"></span></p><p><span style="font-size: 9pt">C:\Windows,</span><span style="font-size: 9pt"> C:\File Program, C:\File Program (x86)</span></p><p><span style="font-size: 11pt"></span></p><p><span style="font-size: 11pt">Ini akan memakan waktu lama, tergantung pada jumlah program dan aplikasi yang terpasang saat ini.</span></p></html>
it: <html><p><span style="font-size: 11pt">Ora che tutto è pronto, è il momento di scaricare i database di debug del programma. L'applicazione scaricherà automaticamente i file PDB per i file .exe e .dll nelle seguenti cartelle nella cartella dei simboli specificata e li analizzerà in seguito:</span></p><p><span style="font-size: 11pt"></span></p><p><span style="font-size: 9pt">C:\Windows,</span><span style="font-size: 9pt"> C:\ Program Files, C:\Program Files (x86)</span></p><p><span style="font-size: 11pt"></span></p><p><span style=" font-size: 11pt">Ci vorrà molto tempo, a seconda della quantità di programmi e app attualmente installati.</span></p></html>
pt_br: <html><p><span style="font-size: 11pt">Agora que está tudo configurado, é hora de baixar os bancos de dados de depuração do programa. O aplicativo baixará automaticamente os arquivos PDB para arquivos .exe e .dll nas seguintes pastas para a pasta de símbolos especificada e os analisará posteriormente:</span></p><p><span style="font-size: 11pt"></span></p><p><span style="font-size: 9pt">C:\Windows,</span><span style="font-size: 9pt"> C:\Program Files, C:\Program Files (x86)</span></p><p><span style="font-size: 11pt"></span></p><p><span style="font-size: 11pt">Isso levará muito tempo, dependendo da quantidade de programas e aplicativos que você instalou atualmente.</span></p></html>
zh: <html><p><span style="font-size: 11pt">现在您已经全部设置好了，是时候下载程序调试数据库了。应用程序会自动将以下文件夹中的 .exe 和 .dll 文件的 PDB 文件下载到指定的符号文件夹中，然后分析它们：</span></p><p><span style="font-size: 11pt"></span></p><p><span style="font-size: 9pt">C:\Windows,</span><span style="font-size: 9pt"> C:\Program Files, C:\Program Files (x86)</span></p><p><span style="font-size: 11pt"></span></p><p><span style="font-size: 11pt">这将需要很长时间，取决于您已安装程序的数量。</span></p></html>

# RL_SymbolFolders.Text
source: Total Folders in {My.Settings.SymbolPath}:
es: Total de carpetas en {My.Settings.SymbolPath}:
id: Total Folder di {My.Settings.SymbolPath}:
it: Cartelle totali in {My.Settings.SymbolPath}:
pt_br: Total de pastas em {My.Settings.SymbolPath}:
zh: {My.Settings.SymbolPath}中的文件夹数：

# RL_SymbolFiles.Text
source: Total Files in {My.Settings.SymbolPath}:
es: Total de archivos en {My.Settings.SymbolPath}:
id: Total File di {My.Settings.SymbolPath}:
it: File totali in {My.Settings.SymbolPath}:
ja: {My.Settings.SymbolPath} のファイル総数:
pt_br: Total de arquivos em {My.Settings.SymbolPath}:
zh: {My.Settings.SymbolPath} 中的文件数：

# RL_SymbolSize.Text
source: Current size of {My.Settings.SymbolPath}:
es: Tamaño actual de {My.Settings.SymbolPath}:
id: Ukuran saat ini dari {My.Settings.SymbolPath}:
it: Dimensioni attuali di {My.Settings.SymbolPath}:
ja: {My.Settings.SymbolPath} の現在のサイズ:
pt_br: Tamanho atual de {My.Settings.SymbolPath}:
zh: {My.Settings.SymbolPath}的当前大小：

# RL_InfoScan.Text
source: <html><p><span style="font-size: 11pt">The Feature Scanner will now automatically begin scanning the PDB Files using mach2</span></p><p><span style="font-size: 11pt"></span></p><p><span style="font-size: 11pt">Do <strong>not </strong>close this Window or mach2, until mach2 is done scanning.</span></p><p></p><p><span style="font-size: 11pt">You will be notified by a desktop notification once the scan completes.</span></p></html>
es: <html><p><span style="font-size: 11pt">El Escáner de Características comenzará automáticamente a escanear los archivos PDB usando mach2</span></p><p><span style="font-size: 11pt"></span></p><p><span style="font-size: 11pt"><strong>No cierres</strong> esta ventana ni mach2, hasta que mach2 haya terminado de escanear.</span></p><p></p><p><span style="font-size: 11pt">Se te notificará con una notificación en el escritorio una vez que se complete el escaneo.</span></p></html>
id: <html><p><span style="font-size: 11pt">Pemindai Fitur sekarang akan secara otomatis mulai memindai File PDB menggunakan mach2</span></p><p><span style="font-size: 11pt"></span></p><p><span style="font-size: 11pt"><strong>Jangan</strong> tutup jendela ini atau mach2, hingga mach2 selesai memindai.</span></p><p></p><p><span style="font-size: 11pt">Anda akan diberi tahu melalui pemberitahuan desktop setelah pemindaian selesai.</span></p></html>
it: <html><p><span style="font-size: 11pt">La funzioen scansione ora inizierà automaticamente la scansione dei file PDB utilizzando mach2</span></p><p><span style="font-size: 11pt"></span></p><p><span style="font-size: 11pt"> <strong>Non chiudere </strong>la sua finestra o mach2, finché mach2 non ha terminato la scansione.</span></p><p></p><p><span style="font-size: 11pt">Una volta completata la scansione sarai avvisato da una notifica sul desktop.</span></p></html>
pt_br: <html><p><span style="font-size: 11pt">O verificador de recursos agora começará a examinar automaticamente os arquivos PDB usando mach2</span></p><p><span style="font-size: 11pt"></span></p><p><span style="font-size: 11pt"> <strong>NÃO </strong>feche esta janela ou mach2 até ele finalizar o verificação.</span></p><p></p><p><span style="font-size: 11pt">Você será notificado assim que a verificação for concluída.</span></p></html>
zh: <html><p><span style="font-size: 11pt">Feature Scanner 现在开始使用 mach2 扫描 PDB 文件</span></p><p><span style="font-size: 11pt"></span></p><p><span style="font-size: 11pt">mach2 完成扫描前，<strong>不要</strong>关闭这个窗口或 mach2。</span></p><p></p><p><span style="font-size: 11pt">扫描完成后，您将收到一个通知。</span></p></html>

# RL_OA.Text
source: Optional Actions:
es: Acciones Opcionales:
id: Aksi Opsional:
it: Azioni opzionali:
ja: アクションのオプション:
pt_br: Ações opções:
zh: 可选操作:

# RB_OA_DeleteSymbolPath.Text
source: Delete {My.Settings.SymbolPath}
es: Eliminar {My.Settings.SymbolPath}
id: Hapus {My.Settings.SymbolPath}
it: Elimina {My.Settings.SymbolPath}
ja: {My.Settings.SymbolPath} を削除
pt_br: Excluir {My.Settings.SymbolPath}
zh: 删除 {My.Settings.SymbolPath}

# RB_OA_CopyFeaturesTXT.Text
source: Save the Features.txt File
es: Guardar el archivo Features.txt
id: Salin File Features.txt ke Desktop Anda
it: Salva il file Features.txt
ja: Features.txtファイルを保存
pt_br: Salvar arquivo Features.txt
zh: 保存 Features.txt

# RL_Done.Text
source: <html><p><span style="font-size: 10pt">The scan has completed. You can now either:</span></p><p><span style="font-size: 10pt"><span style="font-size: 10pt"></span></span></p><ul><li><span style="font-size: 10pt">Review your Features.txt file</span></li><li><span style="font-size: 10pt">or Import your Features.txt file into ViVeTool-GUI by selecting the "Use Manual" Drop Down at the bottom of the Build Combo Box</span></li></ul></html>
es: <html><p><span style="font-size: 10pt">El escaneo ha completado. Ahora puedes:</span></p><p><span style="font-size: 10pt"><span style="font-size: 10pt"></span></span></p><ul><li><span style="font-size: 10pt">Revisar tu archivo Features.txt</span></li><li><span style="font-size: 10pt">o Importar tu archivo Features.txt en ViVeTool-GUI seleccionando la opción "Usar Manual" en el menú desplegable en la parte inferior del menú de compilación</span></li></ul></html>
id: <html><p><span style="font-size: 10pt">Pemindaian telah selesai. Anda sekarang dapat:</span></p><p><span style="font-size: 10pt"><span style="font-size: 10pt"></span></span></p><ul><li><span style="font-size: 10pt">Tinjau file Features.txt Anda</span></li><li><span style="font-size: 10pt"><span style="font-size: 10pt">Unggah file Features.txt Anda ke </span><a href="https://github.com/riverar/mach2/tree/master/features"><color=186,0,0></color=186,0,0><span style="font-size: 10pt">Repositori mach2</span></a><span style="font-size: 10pt"> (akan muncul di Build Combo Box setelah diunggah)</span></span></li><li><span style="font-size: 10pt">atau Impor file Features.txt Anda ke ViVeTool-GUI dengan memilih Drop Down "Gunakan Manual" di bagian bawah Build Combo Box</span></li></ul></html>
it: <html><p><span style="font-size: 10pt">La scansione è stata completata. Adesso puoi:</span></p><p><span style="font-size: 10pt"><span style="font-size: 10pt"></span></span></p><ul><li><span style="font-size: 10pt">Revisionare il file Features.txt</span></li><li><span style="font-size: 10pt">o importare il file Features.txt in ViVeTool-GUI selezionando il menu a discesa "Usa manuale" nella parte inferiore della casella combinata build.</span></li></ul></html>
pt_br: <html><p><span style="font-size: 10pt">A verificação foi concluída. Agora você pode:</span></p><p><span style="font-size: 10pt"><span style="font-size: 10pt"></span></span></p><ul><li><span style="font-size: 10pt">Revisar o arquivo Features.txt</span></li><li><span style="font-size: 10pt">ou importar o seu arquivo Features.txt no ViVeTool-GUI, selecionando"Usar manual" na parte inferior da caixa de combinações da compilação</span></li></ul></html>
zh: <html><p><span style="font-size: 10pt">扫描已完成。您现在可以：</span></p><p><span style="font-size: 10pt"><span style="font-size: 10pt"></span></span></p><ul><li><span style="font-size: 10pt">检查您的 Features.txt</span></li><li><span style="font-size: 10pt"><span style="font-size: 10pt">上传您的 Features.txt 到 </span><a href="https://github.com/riverar/mach2/tree/master/features"><color=186,0,0></color=186,0,0><span style="font-size: 10pt">mach2 仓库</span></a><span style="font-size: 10pt"> (上传后会出现在 Build 组合框中)</span></span></li><li><span style="font-size: 10pt">或选择 Build 组合框底部的“手动加载”来向 ViVeTool-GUI 导入 Feature.txt</span></li></ul></html>

# RL_OutputFile.Text
source: Output File:
es: Archivo de salida:
id: File Output:
it: File destinazione:
ja: 出力ファイル:
pt_br: Arquivo de saída:
zh: 输出文件:

# RTB_UseSystemTheme.Text
source: Use System Theme
es: Usar Tema del Sistema
id: Gunakan Tema Sistem
it: Usa tema di sistema
ja: システムテーマを使用
pt_br: Usar tema do sistema
zh: 跟随系统

# RTB_ThemeToggle.Text
source: Light Theme
es: Tema Claro
id: Tema Terang
it: Tema chiaro
ja: ライトテーマ
pt_br: Tema claro
zh: 浅色模式

# RGB_Theming.HeaderText
source: Theming
es: Tematización
id: Tema
it: Impostazione tema
ja: テーマ
pt_br: Tema
zh: 主题

# RGB_Theming.Text
source: Theming
es: Tematización
id: Tema
it: Impostazione tema
ja: テーマ
pt_br: Tema
zh: 主题

# RL_Comments.Text
source: <html><p>Icons by <a href="https://icons8.com/"><color=186,0,0></color=186,0,0>Icons8.com</a></p><p></p><p><a href="https://github.com/PeterStrick/ViVeTool-GUI"><color=186,0,0></color=186,0,0>PeterStrick/ViVeTool-GUI Github Repository</a></p><p></p><p>Inspired by <a href="https://github.com/thebookisclosed/ViVe/"><color=186,0,0></color=186,0,0>thebookisclosed/ViVe</a></p><p></p><p>Updating Functionallity provided by <a href="https://github.com/ravibpatel/AutoUpdater.NET"><color=186,0,0></color=186,0,0>AutoUpdater.NET</a></p><p></p><p>Feature Scanning Functionallity provided by <a href="https://github.com/riverar/mach2"><color=186,0,0></color=186,0,0>mach2</a></p><p></p><p>Translated by <a href="https://github.com/PeterStrick/ViVeTool-GUI"><color=186,0,0></color=186,0,0>Peter Strick</a></p></html>
id: <html><p>Ikon oleh <a href="https://icons8.com/"><color=186,0,0></color=186,0,0>Icons8.com</a></p><p></p><p><a href="https://github.com/PeterStrick/ViVeTool-GUI"><color=186,0,0></color=186,0,0>Repositori GitHub PeterStrick/ViVeTool-GUI</a></p><p></p><p>Terinspirasi dari <a href="https://github.com/thebookisclosed/ViVe/"><color=186,0,0></color=186,0,0>thebookisclosed/ViVe</a></p><p></p><p>Fungsi Pembaruan disediakan oleh <a href="https://github.com/ravibpatel/AutoUpdater.NET"><color=186,0,0></color=186,0,0>AutoUpdater.NET</a></p><p></p><p>Fungsi Pemindaian Fitur disediakan oleh <a href="https://github.com/riverar/mach2"><color=186,0,0></color=186,0,0>mach2</a></p></html>
pt_br: <html><p>Ícones por <a href="https://icons8.com/"><color=186,0,0></color=186,0,0>Icons8.com</a></p><p></p><p><a href="https://github.com/PeterStrick/ViVeTool-GUI"><color=186,0,0></color=186,0,0>repositório PeterStrick/ViVeTool-GUI no Github</a></p><p></p><p>Inspirado por <a href="https://github.com/thebookisclosed/ViVe/"><color=186,0,0></color=186,0,0>thebookisclosed/ViVe</a></p><p></p><p>Código Combo Box usando <a href="https://github.com/riverar/mach2/tree/master/features"><color=186,0,0></color=186,0,0>files</a> de <a href="https://github.com/riverar/mach2"><color=186,0,0></color=186,0,0>riverar/mach2</a></p><p></p><p>Função de atualização fornecida por <a href="https://github.com/ravibpatel/AutoUpdater.NET"><color=186,0,0></color=186,0,0>AutoUpdater.NET</a></p><p></p><p>Traduzido por <a href="https://github.com/PeterStrick/ViVeTool-GUI"><color=186,0,0></color=186,0,0>igorruckert</a></p></html>
zh: <html><p>Icons by <a href="https://icons8.com/"><color=186,0,0></color=186,0,0>Icons8.com</a></p><p></p><p><a href="https://github.com/PeterStrick/ViVeTool-GUI"><color=186,0,0></color=186,0,0>PeterStrick/ViVeTool-GUI Github Repository</a></p><p></p><p>Inspired by <a href="https://github.com/thebookisclosed/ViVe/"><color=186,0,0></color=186,0,0>thebookisclosed/ViVe</a></p><p></p><p>Updating Functionallity provided by <a href="https://github.com/ravibpatel/AutoUpdater.NET"><color=186,0,0></color=186,0,0>AutoUpdater.NET</a></p><p></p><p>Feature Scanning Functionallity provided by <a href="https://github.com/riverar/mach2"><color=186,0,0></color=186,0,0>mach2</a></p></html>

# $this.Text
source: ViVeTool GUI - Feature Scanner (v1.7 PRE-RELEASE 2)
id: ViVeTool GUI - Feature Scanner

# RadGroupBox1.HeaderText
source: Language
es: Idioma
it: Língua
ja: 言語
pt_br: Idioma

# RDDB_Language.Text
source: Select Language:
es: Seleccionar Idioma:
it: Seleziona lingua:
ja: 言語を選択:
pt_br: Selecionar idioma:

# RadGroupBox1.Text
source: Language
es: Idioma
it: Língua
ja: 言語
pt_br: Linguagem

# RMI_L_Chinese.Text
source: - Chinese
it: 简体中文 - Chinese

# RMI_L_Japanese.Text
source: - Japanese
it: 日本語 - Japanese
