Repository: PeterStrick/ViVeTool-GUI
Catalog: ViVeTool-GUI.FeatureScanner/My Project/Resources.*.resx
Languages: de, id, it, ja, zh

# WB_HTML_Introduction
source: <html><body><span style="font-size: 11pt; font-family: Segoe UI"><p> Welcome to the ViVeTool GUI Feature Scanner </p><p> This Tool is used to download and scan .pdb (Program Debug Database) Files on newer Windows 10/11 Insider Builds to create your own Feature List. </p><p> The ViVeTool GUI Feature Scanner <strong>is not supposed to be used by the average user</strong>. Downloading PDB Files from the Microsoft Symbol Server usually takes an average of 2 Hours depending on your Internet Speed. </p><p> This Tool requires: </p><ul><li><p> 5~30GB of Disk Space to store the downloaded Debug Symbols into </p></li><li><p> A installed copy of the Debugging Tools for Windows available from the Windows SDK </p></li></ul><p> After making sure that the requirements are met, set the Text Boxes below to their respective values and press on "Continue". Hover over them to for an example. </p><p> After that, the application will automatically start to download PDB Files. </p></span></body></html>
de: <html><body><span style="font-size: 11pt; font-family: Segoe UI"><p> Willkommen bei dem ViVeTool GUI Feature Scanner </p><p> Dieses Tool wird verwendet zum herunterladen und durchsuchen von .pdb (Program Debug Database) Dateien auf neuen Windows 10/11 Insider Builds, um eine Feature Liste zu erstellen. </p><p> Die Verwendung des ViVeTool GUI Feature Scanners, <strong>ist nicht für die Verwendung von normalen Benutzern gedacht</strong>. Das Herunterladen der PDB Dateien vom Microsoft Symbol Server, kann abhängig ihrer Internetverbindung mehr als 2 Stunden dauern. </p><p> This Tool requires: </p><ul><li><p> 5~30GB of Disk Space to store the downloaded Debug Symbols into </p></li><li><p> A installed copy of the Debugging Tools for Windows available from the Windows SDK </p></li></ul><p> After making sure that the requirements are met, set the Text Boxes below to their respective values and press on "Continue". Hover over them to for an example. </p><p> After that, the application will automatically start to download PDB Files. </p></span></body></html>
id: <html><body><span style="font-size: 11pt; font-family: Segoe UI"><p> Selamat datang di ViVeTool GUI Feature Scanner </p><p> Alat ini digunakan untuk mengunduh dan memindai File .pdb (Program Debug Database) pada Windows 10/11 Insider Builds yang lebih baru untuk membuat Daftar Fitur Anda sendiri. </p><p> ViVeTool GUI Feature Scanner <strong>tidak seharusnya digunakan oleh pengguna umum</strong>. Mengunduh File PDB dari Server Simbol Microsoft biasanya memakan waktu rata-rata 2 jam tergantung pada kecepatan internet Anda. </p><p> Alat ini membutuhkan: </p><ul><li><p> 5~30GB ruang disk untuk menyimpan Simbol Debug yang diunduh </p></li><li><p> Debugging Tools untuk Windows yang terpasang dari Windows SDK </p></li></ul><p> Setelah memastikan bahwa persyaratan terpenuhi, atur text box di bawah ini ke nilainya masing-masing dan klik "Lanjutkan". Arahkan kursor ke text box sebagai contoh. </p><p> Setelah itu, aplikasi akan secara otomatis mulai mengunduh File PDB. </p></span></body></html>
it: <html><body><span style="font-size: 11pt; font-family: Segoe UI"><p> Benvenuti nello scanner funzionalità della GUI di ViVeTool </p><p> Questo strumento viene usaato per scaricare ed eseguire la scansione di file .pdb (database debug programma) per build Insider di Windows 10/11 più recenti per creare il proprio elenco di funzionalità. </p><p> Lo scanner funzionalità della GUI di ViVeTool <strong>non dovrebbe essere usato dall'utente medio</strong>. Il download di file PDB da Microsoft Symbol Server richiede, a seconda della velocità della connessione internet, in genere una media di 2 ore. </p><p> Questo strumento richiede: </p><ul><li><p> 5 ~ 30 GB di spazio su disco per archiviare i simboli di debug scaricati </p></li><li><p> Una copia installata degli strumenti di debug per Windows disponibile in Windows SDK </p></li></ul><p> Dopo esserti assicurato che i requisiti siano soddisfatti, imposta le caselle di testo sottostanti ai rispettivi valori e seleziona "Continua". Passa il mouse su di essi per un esempio. </p><p> Successivamente, l'applicazione inizierà automaticamente a scaricare i file PDB. </p></span></body></html>
zh: <html><body><span style="font-size: 11pt; font-family: Segoe UI"><p> 欢迎使用 ViVeTool GUI Feature Scanner </p><p> 此工具用于下载和扫描更新的Windows 10/11内部构建上的.pdb(程序调试数据库)文件，以创建自己的功能列表。 </p><p> ViVeTool GUI Feature Scanner <strong>不应被普通用户使用</strong>。从 Microsoft Symbol Server 下载PDB文件通常需要大约 2 小时，具体取决于您的网速。 </p><p> 此工具需要： </p><ul><li><p> 5~30GB 的磁盘空间来存储调试符号 </p></li><li><p> 可从 Windows SDK 获得的 Windows 调试工具的安装副本 </p></li></ul><p> 确保满足要求后，将下面的文本框设置为各自的值，然后按“继续”。将鼠标悬停在文本框上查看示例。 </p><p> 之后，应用程序将自动开始下载PDB文件。 </p></span></body></html>

# Browse_PathToDebuggingTools
source: Path to symchk.exe from the Windows Debugging Tools
de: Pfad zu symchk.exe von den Windows Debug Tools
id: Jalur ke symchk.exe dari Windows Debugging Tools
it: Naviga a symchk.exe dal Windows Debugging Tools
ja: Windowsデバッグツールのsymchk.exeのパス
zh: 指向 Windows Debugging Tools 中 symchk.exe 的路径

# Calculation_Calculating
source: Calculatingâ€¦
de: Berechnet…
id: Menghitung...
it: Calcolo…
ja: 計算中です…
zh: 计算中…

# Calculation_CurrentSizeOf_N
source: Current Size of {0}: {1}
de: Derzeitige Größe von {0}: {1}
id: Ukuran saat ini dari {0}: {1}
it: Dimensione attuale di {0}: {1}
ja: {0} の現在のサイズ: {1}
zh: {0} 的当前大小：{1}

# Calculation_TotalFilesIn_N
source: Total Files in {0}: {1}
de: Gesamtanzahl von Dateien in {0}: {1}
id: Total File di {0}: {1}
it: Totale file in {0}: {1}
ja: {0} の合計のファイル数: {1}
zh: {0} 中的文件数：{1}

# Calculation_TotalFoldersIn_N
source: Total Folders in {0}: {1}
de: Gesamtanzahl von Ordnern in {0}: {1}
id: Total Folder di {0}: {1}
it: Totale cartelle in {0}: {1}
zh: {0} 中的文件夹数：{1}

# Done_Alert_CaptionText
source: Debug Symbol Scan complete
de: Debug Symbol durchsuche abgeschlossen
id: Pemindaian Simbol Debug selesai
it: Scansione simboli debug completata
ja: デバッグシンボルのスキャンが完了しました
zh: 调试符号扫描完成

# Done_FileCopySuccessful_Caption
source: File Copy successful
de: Datei erfolgreich kopiert
id: Salin File berhasil
it: File copiato correttamente
ja: ファイルのコピーに成功しました
zh: 文件复制成功

# Done_FileCopySuccessful_Heading
source: {0} was successfully copied to your desktop.
de: {0} wurde erfolgreich zu ihren Desktop kopiert.
id: {0} berhasil disalin ke desktop Anda.
it: {0} è stato copiato correttamente sul desktop.
ja: {0} は正常にデスクトップにコピーされました。
zh: 成功复制 {0} 到您的桌面。

# Done_OutputFile_N
source: Output File: {0}
de: Ausgangs Datei: {0}
id: File Output: {0}
it: File destinazione: {0}
ja: 出力ファイル: {0}
zh: 输出文件：{0}

# Done_SymbolFolderDeleted_Caption
source: Symbol Folder deleted successfully
de: Debug Symbol Ordner erfolgreich gelöscht
id: Folder Simbol berhasil dihapus
it: Cartella simboli eliminata correttamente
zh: 成功删除符号文件夹

# Done_SymbolFolderDeleted_Heading_N
source: {0} was successfully deleted.
de: {0} wurde erfolgreich gelöscht.
id: {0} berhasil dihapus.
it: {0} è stato correttamente eliminato.
ja: {0} の削除に成功しました。
zh: 成功删除 {0} 。

# Error_AnErrorOccurred
source: An Error occurred
de: Ein Fehler ist aufgetreten
id: Terjadi kesalahan
it: Si è verificato un errore
zh: 发生了一个错误

# Error_AnExceptionOccurred
source: An Exception occurred
de: Ein kritischer Fehler ist aufgetreten
id: Terjadi Exception
it: Si è verificata un'eccezione
zh: 发生了一个异常

# Error_CollapseException
source: Collapse Exception
de: Fehlerdetails zuklappen
id: Sembunyikan Exception
it: Comprimi eccezione
zh: 发生了崩溃

# Error_CopyException
source: An Exception occurred while trying to copy {0} to your desktop.
de: Beim Versuch {0} auf Ihren Desktop zu kopieren, ist eine Ausnahme aufgetreten.
id: Terjadi Exception saat mencoba menyalin {0} ke desktop Anda.
it: Si è verificata un'eccezione durante il tentativo di copiare {0} sul desktop.
zh: 在尝试复制 {0} 到您的桌面是发生了异常。

# Error_IOError
source: IO Error
de: IO Fehler
id: Kesalahan IO
it: Errore I/O
zh: IO 错误

# Error_mach2Scan_1_ToBeMigrated
source: An Error occurred while scanning the symbol files.
de: Beim Versuch die Symbol Dateien zu durchsuchen, ist ein Fehler aufgetreten.
zh: 扫描符号文件时发生了错误。

# Error_mach2Scan_2_ToBeMigrated
source: The application will attempt to rescan the symbol folder.
de: Die Anwendung wird nun versuchen, den Symbol Ordner erneut zu durchsuchen.
zh: 程序将尝试重新扫描符号文件夹。

# Error_MissingFiles_Heading
source: An Error occurred. Files required for ViVeTool GUI Feature Scanner to work properly are missing.
de: Ein Fehler ist aufgetreten. Notwendige Dateien für den ViVeTool GUI Feature Scanner fehlen.
id: Terjadi kesalahan. File yang diperlukan agar ViVeTool GUI Feature Scanner berfungsi dengan baik tidak ada.
it: Si è verificato un errore. Mancano i file necessari per il corretto funzionamento della scansione funzioni ViVeTool GUI.
zh: 发生了错误。用于 ViVeTool GUI Feature Scanner 正常工作的文件丢失。

# Error_MissingFiles_Text_ToBeMigrated
source: Please check that the following files are present:
de: Bitte überprüfen sie, dass die folgenden Dateien vorhanden sind:
zh: 请检查以下文件是否存在：

# Error_ShowException
source: Show Exception
de: Fehlerdetails aufklappen
id: Tampilkan Exception
it: Visualizza eccezione
zh: 显示异常信息

# Error_Spaced_AnErrorOccurred
source: An Error occurred
de: Ein Fehler ist aufgetreten
id: Terjadi kesalahan
zh: 发生了一个错误

# Error_Spaced_AnExceptionOccurred
source: An Exception occurred
de: Eine Ausnahme ist aufgetreten
id: Terjadi Exception
zh: 发生了一个异常

# Error_SymbolDownload1_ToBeMigrated
source: An Error occurred while downloading the symbol files.
de: Während des Symboldateien herunterladen, ist ein Fehler aufgetreten.
zh: 下载符号文件时发生了错误。

# Error_SymbolFolderDeleted_N
source: An Exception occurred while trying to delete {0}
de: Eine Ausnahme trat beim Versuch auf, {0} zu löschen
id: Terjadi Exception saat mencoba menghapus {0}
it: Si è verificata un'eccezione durante il tentativo di eliminare {0}
zh: 在尝试删除 {0} 时发生了异常

# Generic_DarkTheme
source: Dark Theme
de: Dunkles Thema
id: Tema Gelap
it: Tema scuro
ja: ダークテーマ
zh: 深色模式

# Done_SymbolDelete
source: Delete {0}
de: {0} löschen
id: Hapus {0}
it: Elimina {0}
ja: {0} を削除
zh: 删除 {0}

# Generic_LightTheme
source: Light Theme
de: Helles Thema
id: Tema Terang
it: Tema chiaro
ja: ライトテーマ
zh: 浅色模式

# SymbolDownloaded
source: Symbol {0} downloaded.
de: Symbol {0} heruntergeladen.
id: Simbol {0} diunduh.
it: Simbolo {0} scaricato.
ja: シンボル {0} をダウンロードしました。
zh: 符号 {0} 已下载。

# Error_CopyExceptionAndClose_ToolTip
source: Copies the Exception to the Clipboard and closes the dialog
de: Kopiert die Fehlerdetails in die Zwischenablage, und schließt den Dialog
id: Menyalin Exception ke clipboard dan menutup dialog
it: Copia l'eccezione negli Appunti e chiudi la finestra di dialogo
zh: 复制异常信息到剪贴板并关闭

# Generic_Close
source: Close
de: Schließen
id: Tutup
it: Chiudi
ja: 閉じる
zh: 关闭

# ToolTip_RTB_DbgPath
source: Example Path: C:\Program Files\Windows Kits\10\Debuggers\x64\symchk.exe
de: Beispiel Pfad: C:\Program Files\Windows Kits\10\Debuggers\x64\symchk.exe
id: Contoh Jalur: C:\File Program\Windows Kits\10\Debuggers\x64\symchk.exe
it: Esempio percorso: C:\Program Files\Windows Kits\10\Debuggers\x64\symchk.exe
ja: パスの例: C:\Program Files\Windows Kits\10\Debuggers\x64\symchk.exe
zh: 示例路径：C:\Program Files\Windows Kits\10\Debuggers\x64\symchk.exe

# ToolTip_RTB_SymbolPath
source: The Downloaded Debug Symbols can be up to 5~30GB in size.
de: Die heruntergeladenen Debug Symbole können zwischen 5 und 30 GB in Gesamtgröße variieren.
id: Simbol Debug yang Diunduh dapat berukuran hingga 5~30GB.
it: Il file da scaricare dei simboli debug può essere grande da 5 a 30 GB.
ja: ダウンロードをしたデバッグシンボルは、最大で5~30GBのサイズになります。
zh: 已下载的调试符号的大小可达 5~30GB。

# Browse_SymbolPath_Description
source: Select a Folder to store the downloaded Debug Symbols into. The downloaded .pdb Files usually take up to 5~8GB of Space.
de: Wählen Sie einen Ordner aus, um die heruntergeladenen Debug Symbole zu speichern. Die heruntergeladenen .PDB Dateien benötigen normalerweise bis zu 5 bis 8 GB Speicherplatz.
id: Pilih Folder untuk menyimpan Simbol Debug yang diunduh. File .pdb yang diunduh biasanya memakan ruang hingga 5~8GB.
it: Seleziona una cartella in cui archiviare i simboli di debug scaricati. I file .pdb scaricati in genere occupano fino a 5~8 GB di spazio.
zh: 选择一个文件夹来存储调试符号。下载的 .pdb 文件一般会占用 5~8 GB 的空间。

# Done_Alert_ContentText
source: The Debug Symbol Scan is complete. Return to the ViVeTool GUI Feature Scanner to find out more.
de: Der Debug Symbol Scan ist vollständig. Kehren Sie zum ViVeTool GUI Feature Scanner zurück, um mehr zu erfahren.
id: Pemindaian Simbol Debug selesai. Kembali ke ViVeTool GUI Feature Scanner untuk mengetahui lebih lanjut.
it: La scansione dei simboli debug è stata completa. Per maggiori info torna alla scansione funzioni ViVeTool GUI.
zh: 调试符号扫描完成。返回 ViveTool GUI Feature Scanner 查看更多。

# Error_SymbolDownload2_ToBeMigrated
source: Check if you have access to symchk.exe and that your Anti-virus isn't blocking it.
de: Überprüfen Sie, ob Sie Zugriff auf symchk.exe haben und dass Ihr Antivirus es nicht blockiert.
zh: 检查你是否有权限访问 synchk.exe，并且没有被防病毒软件阻止。

# Error_SymbolFolderTestFile1_ToBeMigrated
source: An Error occurred while trying to write a test file to the symbol folder.
de: Beim Versuch, eine Testdatei in den Symbolordner zu schreiben, ist ein Fehler aufgetreten.
zh: 在尝试向符号文件夹写入测试文件时发生了错误。

# Error_SymbolPathException1_N
source: An Exception occurred while trying to write a test file to {0}
de: Eine Ausnahme trat beim Versuch auf, eine Testdatei auf {0} zu schreiben
id: Terjadi Exception saat mencoba menulis file uji ke {0}
it: Si è verificata un'eccezione durante il tentativo di scrivere un file di prova in {0}
zh: 在尝试向 {0} 写入测试文件时发生了异常

# Error_SymbolFolderTestFile2_ToBeMigrated
source: A symbol folder must be specified to download Program Debug Database files into.
de: Ein Symbol Ordner muss angegeben werden, um die Program Debug Datenbankdateien herunterzuladen.
zh: 必须指定一个符号文件夹，以便将程序调试数据库文件下载到其中。

# Error_SymbolPath1_N_ToBeMigrated
source: An Error occurred while trying to write a test file to {0}
de: Beim Versuch, eine Testdatei in {0} zu schreiben, ist ein Fehler aufgetreten
zh: 在尝试向 {0} 写入测试文件时发生了错误

# Error_SymbolPath2_ToBeMigrated
source: Please make sure that the application has write access to the folder, and that the folder isn't write protected.
de: Bitte stellen Sie sicher, dass die Anwendung einen Schreibzugriff auf den Ordner hat und dass der Ordner nicht schreibgeschützt ist.
zh: 请确保程序对该文件夹具有写访问权限，并且该文件夹没有写保护。

# Error_SymchkPath1_ToBeMigrated
source: An Error occurred while checking if the specified Path to symchk.exe is valid.
de: Bei der Pfad-Überprüfung trat ein Fehler auf, überprüfen Sie ob der angegebene Pfad zu symchk.exe gültig ist.
zh: 检查指定的 symchk.exe 路径是否有效时发生了错误。

# Error_SymchkPath2_ToBeMigrated
source: Please be sure to enter a valid path to symchk.exe.
de: Bitte geben Sie einen gültigen Pfad zu symchk.exe ein.
zh: 请确保输入 symchk.exe 的有效路径。

# Error_SymchkPath3_ToBeMigrated
source: If you can not find symchk.exe, it is usually located at the Installation Directory of the Windows SDK\10\Debuggers\x64
de: Wenn Sie symchk.exe nicht finden können, befindet sich dies normalerweise im Installationsverzeichnis des Windows SDK\10\Debuggers\x64
zh: 如果你找不到 symchk.exe, 它通常位于 SDK 的安装目录：Windows SDK\10\Debuggers\x64

# Error_UnsupportedBuild_Text_N
source: You are running an unsupported Windows 10 Build. ViVe, ViVeTool and ViVeTool GUI require Windows 10 Build 18963 or higher to function properly. Your Build is: {0}
de: Sie führen ein nicht unterstütztes Windows 10 Build aus. ViVe, ViVeTool und ViVeTool GUI benötigen Windows 10 Build 18963 oder höher, um ordnungsgemäß zu funktionieren. Ihr Build ist: {0}
id: Anda menjalankan Windows 10 dengan Build yang tidak didukung. ViVe, ViVeTool dan ViVeTool GUI memerlukan Windows 10 Build 18963 atau lebih tinggi untuk berfungsi dengan baik. Build Anda saat ini adalah: {0}
it: Stai eseguendo una build di Windows 10 non supportata. Per funzionare correttamente ViVe, ViVeTool e ViVeTool GUI richiedono Windows 10 Build 18963 o superiore. Questa è la build: {0}
zh: 你正在运行一个不受支持的 Windows 10 Build。Vive，ViveTool 和 ViveTool GUI 需要 Windows 10 Build 18963 或更高才能正常运行。你的 Build 是：{0}

# Error_UnsupportedBuild
source: Unsupported Build
de: Nicht unterstütztes Build
id: Build Tidak Didukung
it: Build non supportata
zh: 不支持的 Build

# Error_Spaced_UnsupportedBuild
source: Unsupported Build
de: Nicht unterstütztes Build
id: Build Tidak Didukung
zh: 不支持的 Build

# Error_MissingFiles_Text_N
source: Please check that the following files are present: {0}
de: Bitte überprüfen sie, dass die folgenden Dateien vorhanden sind: {0}
it: Verifica che siano presenti i seguenti file: {0}
zh: 请检查以下文件是否存在： {0}

# Error_mach2Scan_N
source: An Error occurred while scanning the symbol files. The application will attempt to rescan the symbol folder.
it: Si è verificato un errore durante la scansione dei file dei simboli. L'applicazione tenterà di ripetere la scansione della cartella dei simboli.

# Error_SymchkPath_N
source: An Error occurred while checking if the specified Path to symchk.exe is valid. Please be sure to enter a valid path to symchk.exe. If you can not find symchk.exe, it is usually located at the Installation Directory of the Windows SDK\10\Debuggers\x64
it: Si è verificato un errore durante il controllo della validità del percorso specificato per symchk.exe. Assicurati di inserire un percorso valido per symchk.exe. Se non riesci a trovare symchk.exe, di solito si trova nella cartella di installazione di Windows SDK\10\Debuggers\x64

# Error_SymbolFolderTestFile_N
source: An Error occurred while trying to write a test file to the symbol folder. A symbol folder must be specified to download Program Debug Database files into.
it: Si è verificato un errore durante il tentativo di scrivere un file di prova nella cartella dei simboli. È necessario specificare una cartella dei simboli in cui scaricare i file del database di debug del programma.

# Error_SymbolDownload_N
source: An Error occurred while downloading the symbol files. Check if you have access to symchk.exe and that your Anti-virus isn't blocking it.
it: Si è verificato un errore durante il download dei file dei simboli. Controlla se hai accesso a symchk.exe e che l'antivirus non lo stia bloccando.

# Error_SymbolPath_NewN
source: An Error occurred while trying to write a test file to {0} Please make sure that the application has write access to the folder, and that the folder isn't write protected.
it: Si è verificato un errore durante il tentativo di scrivere un file di prova in {0} Assicurati che l'applicazione abbia accesso in scrittura alla cartella e che la cartella non sia protetta da scrittura.
